cask_args appdir: "/Applications"

tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/autoupdate"
tap "janw/tap"

# Shells
brew "fish"
brew "zsh"
brew "bash"

# Databases + tools
cask "postgres-unofficial"
cask "postico"
brew "redis", start_service: true

# Unix
brew "asdf"
brew "curl"
brew "direnv"
brew "duti"
brew "ffmpeg"
brew "git-lfs"
brew "git"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "mas"
brew "npm"
brew "openssl"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "pre-commit"
brew "pv"
brew "reattach-to-user-namespace"
brew "restic"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "shellcheck"
brew "sponge"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "watch"
brew "wget"
brew "yq"
brew "yt-dlp"

# Kubernetes
brew "kubernetes-cli"
brew "helm"
brew "stern"
brew "kubectx"
brew "k3sup"
brew "k9s"

# Encryption
brew "age"
brew "age-plugin-yubikey"
brew "sops"
brew "ksops"
cask "gpg-suite-no-mail"

# Docker
cask "docker"
brew "docker-buildx"
brew "docker-compose"
brew "hadolint"

# Random applications
cask "iterm2"
cask "1password"
cask "alfred"
cask "affinity-designer"
cask "affinity-photo"
cask "appcleaner"
cask "db-browser-for-sqlite"
cask "visual-studio-code"
cask "rectangle"
cask "maccy"
cask "vlc"
cask "httpie"
cask "coconutbattery"
cask "fluor"
cask "gpg-suite-no-mail"
cask "keyboardcleantool"
cask "spotify"

# Browsers
cask "arc"
cask "firefox"
cask "google-chrome"
cask "tor-browser"

# Programming language prerequisites
brew "openssl"
brew "libyaml" # should come after openssl
brew "readline"
brew "xz"
brew "gettext"

# Fonts
cask "font-ibm-plex"
cask "font-inconsolata-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-maple"

# Quicklook
cask "qlmarkdown"
